app/Helpers/common_helper.php

function get_products_by_category($categoryModel, $productModel)
{
  // Initialize an empty array to hold products grouped by category
  $productsByCategory = [];

  // Fetch all categories
  $categories = $categoryModel->findAll();
---
SELECT *
FROM `categories`