app/Filters/AdminRoutesFilter.php

    public function before(RequestInterface $request, $arguments = null)
    {
        $session = \Config\Services::session();
        $userid = session('userid');
        $db = \Config\Database::connect();
        $query = $db->table('users')->where('id', $userid)->get();
---
SELECT *
FROM `users`
WHERE `id` IS NULL