app/Controllers/Home.php

    public function index()
    {
        $categoryModel = new CategoryModel();
        $productModel = new ProductModel();

        // Fetch categories and products with their related images
        $data['categories'] = $categoryModel->findAll();
---
SELECT *
FROM `categories`

    public function product_detail($id)
    {
        $productModel = new ProductModel();
        $productImageModel = new ProductImagesModel();

        // Fetch product by slug
        $product = $productModel->where('id', $id)->first();

        if (!$product) {
            throw new \CodeIgniter\Exceptions\PageNotFoundException("Product not found");
        }

        // Fetch related images for the product
        $productImages = $productImageModel->where('product_id', $product['id'])->findAll();
---
SELECT *
FROM `products`
WHERE `id` = '38'
 LIMIT 1
SELECT *
FROM `product_images`
WHERE `product_id` = '38'

    public function checkin(): string
    {
        $data = [];
        if (!empty($_COOKIE['cart_cookie'])) {
            $cart_cookie = $_COOKIE['cart_cookie'];
            $cart_detail = json_decode($cart_cookie);

            $product_model = new ProductModel();


            foreach ($cart_detail as $key => $val) {
                $data['product_detail'][$key] = $product_model->where('id', $val->product_detail->id)->first();
---
SELECT *
FROM `products`
WHERE `id` = '38'
 LIMIT 1

    public function checkout(): string
    {

        $data = [];
        if (!empty($_COOKIE['cart_cookie'])) {
            $cart_cookie = $_COOKIE['cart_cookie'];
            $cart_detail = json_decode($cart_cookie);

            $product_model = new ProductModel();


            foreach ($cart_detail as $key => $val) {
                $data['product_detail'][$key] = $product_model->where('id', $val->product_detail->id)->first();
---
SELECT *
FROM `products`
WHERE `id` = '41'
 LIMIT 1

    public function add_tocart()
    {
        $productid = $this->request->getGet('product_id');
        $quantity = $this->request->getGet('quantity');

        $product_model = new ProductModel();
        $data['product_detail'] = $product_model->select('id')->where('id', $productid)->first();
---
SELECT `id`
FROM `products`
WHERE `id` = '40'
 LIMIT 1

    public function order_placement()
    {

        if (isset($_COOKIE['cart_cookie'])) {
            $cart_cookie = $_COOKIE['cart_cookie'];
            $cart_detail = json_decode($cart_cookie);
            //start calculating amount

            $product_optionmodel = new ProductModel();
            foreach ($cart_detail as $val) {
                $get_option = $product_optionmodel->where('id', $val->product_detail->id)->first();
---
SELECT *
FROM `products`
WHERE `id` = '41'
 LIMIT 1