app/Controllers/Home.php

    public function product_detail($id)
    {
        $productModel = new ProductModel();
        $productImageModel = new ProductImagesModel();
        $categoryModel = new CategoryModel();

        // Fetch product by slug
        $product = $productModel->where('id', $id)->first();

        if (!$product) {
            throw new \CodeIgniter\Exceptions\PageNotFoundException("Product not found");
        }

        // Fetch related images for the product
        $productImages = $productImageModel->where('product_id', $product['id'])->findAll();
---
SELECT *
FROM `product_images`
WHERE `product_id` = '41'

    public function add_tocart()
    {
        $productid = $this->request->getGet('product_id');
        $quantity = $this->request->getGet('quantity');
        $colors = $this->request->getGet('color');
        $sizes = $this->request->getGet('size');

        if (empty($colors) || empty($sizes)) {
            return $this->response->setJSON(['status' => 0, 'message' => 'Please select at least one color and one size.']);
        }

        $product_model = new ProductModel();
        $product_detail = $product_model->select('id')->where('id', $productid)->first();
---
SELECT `id`
FROM `products`
WHERE `id` = '41'
 LIMIT 1

    public function checkin(): string
    {
        $data = [];
        $cart_cookie = $this->request->getCookie('cart_cookie');

        if (!empty($cart_cookie)) {
            // Decode the cookie data to access cart details
            $cart_detail = json_decode($cart_cookie, true);

            $product_model = new ProductModel();
            $product_details = [];

            // Fetch product details and merge with cart item data (color, size, quantity)
            foreach ($cart_detail as $key => $val) {
                $product_info = $product_model->where('id', $val['id'])->first();
---
SELECT *
FROM `products`
WHERE `id` = '35'
 LIMIT 1