app/Controllers/ProductController.php

    public function product_list()
    {
        // Get input parameters
        $input = $this->request->getGet();
        $page = max((int) ($input['page'] ?? 1), 1);
        $perpage = max((int) ($input['page_limit'] ?? 10), 1);
        $role_id = $input['role_id'] ?? null;

        $ProductModel = new ProductModel();
        // Build the query
        $ProductModel->select('products.*, categories.title AS category_title')
            ->join('categories', 'products.category_id = categories.id', 'left')
            ->orderBy('products.id', 'ASC')
            ->where('products.status', 'active');

        if (!empty($role_id)) {
            $ProductModel->where('roles.id', $role_id);
        }

        // Get total count of products
        $total_items = $ProductModel->countAllResults(false);

        // Fetch paginated products
        $products = $ProductModel->paginate($perpage, 'custom_pagination', $page);
---
SELECT COUNT(*) AS `numrows`
FROM `products`
LEFT JOIN `categories` ON `products`.`category_id` = `categories`.`id`
WHERE `products`.`status` = 'active'
SELECT `products`.*, `categories`.`title` AS `category_title`
FROM `products`
LEFT JOIN `categories` ON `products`.`category_id` = `categories`.`id`
WHERE `products`.`status` = 'active'
ORDER BY `products`.`id` ASC
 LIMIT 10

    public function save_edit_product($id)
    {
        $session = \Config\Services::session();
        $role_id = $session->get('role_id');
        // Load the Product and ProductImages models
        $productModel = new ProductModel();
        $productImagesModel = new ProductImagesModel();

        // Validate the input
        $validation = \Config\Services::validation();
        $validation->setRules([
            'title' => 'required',
            'category_id' => 'required',
            'price' => 'required|numeric',
            'stock' => 'required|integer',
            'meta_keywords' => 'required',
            'description' => 'required',
        ]);

        if (!$this->validate($validation->getRules())) {
            // Validation failed, redirect back with errors
            return redirect()->back()->withInput()->with('validation', $this->validator->getErrors());
        }

        // Fetch the existing product to check if it exists
        $product = $productModel->find($id);
---
SELECT *
FROM `products`
WHERE `products`.`id` = '31'